dag_logs/execution_dag_20250707_052918.dot
digraph ExecutionDAG {
    rankdir=TB;
    node [shape=box, style=rounded];
    "BOOTSTRAP" [label="BOOTSTRA...\nSYSTEM", fillcolor=lavender, style="rounded,filled"];
    "sentinel_instance_01" [label="sentinel...\nCOMPONENT", fillcolor=pink, style="rounded,filled"];
    "quantifier_agent_primary" [label="quantifi...\nCOMPONENT", fillcolor=pink, style="rounded,filled"];
    "SEED_EXEC_test_iter1" [label="SEED_EXE...\nSEED_EXECUTION", fillcolor=khaki, style="rounded,filled"];
    "2c01ef20-7113-43a7-8529-6e896fd66942" [label="2c01ef20...\nSEED_IDEA", fillcolor=lightgreen, style="rounded,filled"];
    "5cb45cd9-b5c9-4b92-afdc-99a867552317" [label="5cb45cd9...\nGENERATED_IDEA\n**Title: "The Lobster's Great ...", fillcolor=lightblue, style="rounded,filled"];
    "2961045c-5452-488b-95e2-93369a93c601" [label="2961045c...\nGENERATED_IDEA\nTitle: "The Great Lobster Expe...", fillcolor=lightblue, style="rounded,filled"];
    "8ed61b36-697a-4138-83ec-dd4957518594" [label="8ed61b36...\nGENERATED_IDEA\nTitle: "The Lobster's Journey:...", fillcolor=lightblue, style="rounded,filled"];
    "2c01ef20-7113-43a7-8529-6e896fd66942" -> "5cb45cd9-b5c9-4b92-afdc-99a867552317" [label="GENERATES\ndepth=0"];
    "2c01ef20-7113-43a7-8529-6e896fd66942" -> "2961045c-5452-488b-95e2-93369a93c601" [label="GENERATES\ndepth=0"];
    "2c01ef20-7113-43a7-8529-6e896fd66942" -> "8ed61b36-697a-4138-83ec-dd4957518594" [label="GENERATES\ndepth=0"];
}
